# vstDrawCoordLine

## Description
```pascal
PROCEDURE vstDrawCoordLine(
				pt1X : REAL;
				pt1Y : REAL;
				pt2X : REAL;
				pt2Y : REAL);
```

```python

def vs.vstDrawCoordLine(pt1X, pt1Y, pt2X, pt2Y):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt1X|REAL||
|pt1Y|REAL||
|pt2X|REAL||
|pt2Y|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events